{
  "backend/main.mo": "Defines core Motoko actor types, state maps, IDs, and admin authorization mixin for orders, bookings, loyalty, districts, artifacts, and delivery zones.",
  "feature_evidence.json": "Lists feature evidence records describing backend‑frontend integration requirements, related files, components, and associated tests.",
  "frontend-file-summaries.txt": "Provides human‑written summaries for numerous frontend files, describing their purpose and behavior for build planning.",
  "frontend/index.css": "Tailwind base layer defining global OKLCH color variables for light and dark themes and applying core layout styles.",
  "frontend/index.html": "Basic HTML entry file mounting the app root and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with theme provider and toast notifications.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, footer, routing outlet, and bottom nav visibility logic.",
  "frontend/src/components/auth/AdminGate.tsx": "Wraps children with admin-access control using Internet Identity, showing loading, login, error, or denial states as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button for Internet Identity with handling for authentication state and error recovery.",
  "frontend/src/components/BookingCalendar.tsx": "Booking calendar UI showing selectable dates and static example time slots.",
  "frontend/src/components/BookingRequestForm.tsx": "Form for submitting booking requests with fields, package customization, validation, and mutation handling.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with buttons for key app sections and highlights the active route.",
  "frontend/src/components/home/HomeLiveCounters.tsx": "Shows three live metric counters with fallback values and graceful error handling.",
  "frontend/src/components/InAppNotificationBanner.tsx": "Displays a green success-style alert banner with a dismiss button for in‑app notifications.",
  "frontend/src/components/LoyaltyPointsPanel.tsx": "Shows the user’s loyalty points balance and transaction history, handling login and loading states.",
  "frontend/src/components/LoyaltyRedemptionPanel.tsx": "Lists redeemable rewards, checks point balance, and allows users to redeem items with loading and error handling.",
  "frontend/src/components/MembershipProfileForm.tsx": "Manages membership creation or displays existing membership details, including verification and VIP status.",
  "frontend/src/components/OriginMapSection.tsx": "Displays an origin map and district selector, showing producer details for the selected district.",
  "frontend/src/components/PackageCustomizer.tsx": "Provides a UI to select a base package and toggle add‑ons, pulling available options from queries.",
  "frontend/src/components/SocialImpactMeter.tsx": "Shows environmental impact metrics in cards, with loading handling and metric visualization.",
  "frontend/src/components/VirtualTourSection.tsx": "Displays a 360° virtual tour section with zone selection and placeholder content when panoramas are unavailable.",
  "frontend/src/data/menuItems.ts": "Defines menu item types, categories, a static list of menu items, and helper functions for filtering by category.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook managing authentication, identity loading, states, and AuthClient setup.",
  "frontend/src/hooks/useOrderStatusPolling.ts": "Custom hook that polls client orders and queue position, manages countdown timers, and triggers notifications on status changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for orders, profiles, queue data, and artifacts.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base element styles.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminAnalyticsPanel.tsx": "Displays administrative analytics including orders, users, bookings, and members with refresh support.",
  "frontend/src/pages/admin/AdminBookingsPanel.tsx": "Lists all space bookings for admins with tools to update booking statuses.",
  "frontend/src/pages/admin/AdminElectricityAtsPanel.tsx": "Placeholder panel showing upcoming ATS monitoring features.",
  "frontend/src/pages/admin/AdminInventoryPanel.tsx": "Placeholder panel for future inventory management and low-stock alerts.",
  "frontend/src/pages/admin/AdminLoyaltyRewardsPanel.tsx": "Provides a form to create loyalty rewards and displays a list of existing rewards with loading states. Handles validation, submission, and success/error toasts.",
  "frontend/src/pages/admin/AdminLoyaltyVerificationPanel.tsx": "Displays membership requests in a table and allows admins to approve or reject them. Includes loading, empty, and error handling with toast feedback.",
  "frontend/src/pages/admin/AdminMuseumContentPanel.tsx": "Allows admins to create artifacts with title, story, and optional audio URL, and shows existing artifacts. Handles form validation, submissions, and toasts.",
  "frontend/src/pages/admin/AdminOrdersQueuePanel.tsx": "Shows active orders with status controls and supports updating order status. Includes loading, error states, and refresh functionality.",
  "frontend/src/pages/admin/AdminOriginMapPanel.tsx": "Enables creation of district entries with name, featured product, photo, and description, and lists existing districts. Validates inputs and provides toast feedback.",
  "frontend/src/pages/admin/AdminPackagesPanel.tsx": "Manages package creation and add-ons with separate forms and displays existing items. Handles loading states and success/error toasts.",
  "frontend/src/pages/admin/AdminSocialImpactPanel.tsx": "Admin panel React component that lets admins update a metric and displays current metrics with loading states.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard with tabs for managing the orders queue and viewing analytics, gated by admin access.",
  "frontend/src/pages/ArtifactDetailPage.tsx": "Artifact details page fetching item data and optionally playing its audio story with play/pause controls.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring hero content, navigation buttons, and highlighted digital features of the cafe.",
  "frontend/src/pages/LoyaltyPage.tsx": "Loyalty program page with tabs for profile management, points overview, and rewards redemption.",
  "frontend/src/pages/MenuPage.tsx": "Displays menu items grouped by category and shows kitchen queue status with estimated wait times.",
  "frontend/src/pages/MiniMuseumPage.tsx": "Shows artifact cards with QR-enabled audio stories and includes origin map and social impact sections.",
  "frontend/src/pages/OrderStatusPage.tsx": "Tracks a specific order’s real-time status with polling, queue position, and notifications.",
  "frontend/src/pages/SpaceBookingPage.tsx": "Provides space booking tools with a calendar, request form, and virtual tour tabs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and sessionStorage values.",
  "frontend/tailwind.config.js": "Tailwind configuration defining color tokens, typography, container settings, animations, and plugins.",
  "project_state.json": "Project state descriptor containing metadata, feature lists, known issues, and pending requirements for the D’ZETA Space app."
}