{
  "backend/main.mo": "Defines data types and initializes in-memory maps for orders, bookings, memberships, loyalty, impact metrics, and admin authorization with core actor scaffolding. Includes parcel comparison logic and various domain models for the backend.",
  "feature_evidence.json": "Feature evidence report listing admin-route protection and admin dashboard functionality, mapping features to related source files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files detailing behavior of hooks, pages, components, and styling.",
  "frontend/index.css": "Tailwind base styles defining earthy OKLCH color tokens for light and dark themes and applying global background and text variables.",
  "frontend/index.html": "Basic HTML shell loading the React root element and main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all app pages, including home, museum, ordering, booking, loyalty, and admin, wrapped in a theme provider.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, footer, scroll reset, conditional bottom nav, and routing outlet.",
  "frontend/src/components/auth/AdminGate.tsx": "Auth gate that checks Internet Identity and admin status, showing loaders, login, or error states before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with status handling and error recovery.",
  "frontend/src/components/BookingCalendar.tsx": "Booking calendar component showing selectable dates and static time slots within a card UI.",
  "frontend/src/components/BookingRequestForm.tsx": "Booking request form handling date, zone, notes, package customization, and submission via booking mutation with success/error toasts.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar with icons and highlighting for menu, museum, booking, and loyalty routes.",
  "frontend/src/components/home/HomeLiveCounters.tsx": "Displays live or fallback metric counters with icons, handling loading and error states.",
  "frontend/src/components/InAppNotificationBanner.tsx": "Renders a dismissible success-style alert banner with a message and close button.",
  "frontend/src/components/LoyaltyPointsPanel.tsx": "Displays the user's loyalty points balance and transaction history, with login and loading states.",
  "frontend/src/components/LoyaltyRedemptionPanel.tsx": "Shows available rewards and allows users to redeem points, handling loading, login, and insufficient balance cases.",
  "frontend/src/components/MembershipProfileForm.tsx": "Handles membership profile creation and displays existing membership details, including verification and VIP status.",
  "frontend/src/components/OriginMapSection.tsx": "Displays an origin map and district list, showing details for the selected district including description and farmer photo.",
  "frontend/src/components/PackageCustomizer.tsx": "Allows users to select a base package and optional add-ons, with loading states for package and add-on data.",
  "frontend/src/components/SocialImpactMeter.tsx": "Shows environmental impact metrics in a grid, with loading handling and metric values.",
  "frontend/src/components/VirtualTourSection.tsx": "Displays a 360° virtual tour section with selectable zones, showing placeholders when panoramas are unavailable.",
  "frontend/src/data/menuItems.ts": "Defines menu item types, menu categories, a static menu list, and helpers for retrieving items.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, and stored identity management via AuthClient.",
  "frontend/src/hooks/useOrderStatusPolling.ts": "Polls client orders and queue position, computes countdowns, and triggers notifications on status changes.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, orders, queue data, and artifact content through an actor API.",
  "frontend/src/index.css": "Defines global Tailwind layers and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminAnalyticsPanel.tsx": "Shows admin business metrics with loading and error handling using cards and icons.",
  "frontend/src/pages/admin/AdminBookingsPanel.tsx": "Lists all space bookings and allows admins to update booking status with refetch support.",
  "frontend/src/pages/admin/AdminElectricityAtsPanel.tsx": "Placeholder panel showing ATS monitoring is not yet implemented.",
  "frontend/src/pages/admin/AdminInventoryPanel.tsx": "Placeholder panel indicating inventory management features are coming soon.",
  "frontend/src/pages/admin/AdminLoyaltyRewardsPanel.tsx": "Allows adding new loyalty rewards and displays the list of existing rewards with loading states.",
  "frontend/src/pages/admin/AdminLoyaltyVerificationPanel.tsx": "Displays membership requests and allows admins to approve or reject them using verification mutations.",
  "frontend/src/pages/admin/AdminMuseumContentPanel.tsx": "Provides a form to create artifacts and lists existing artifacts with loading and error handling.",
  "frontend/src/pages/admin/AdminOrdersQueuePanel.tsx": "Shows active orders, supports status updates, and handles loading, errors, and manual refresh.",
  "frontend/src/pages/admin/AdminOriginMapPanel.tsx": "Allows admins to create districts with metadata and displays existing district data when loaded.",
  "frontend/src/pages/admin/AdminPackagesPanel.tsx": "Enables adding base packages and add-ons while showing existing items with loading states.",
  "frontend/src/pages/admin/AdminSocialImpactPanel.tsx": "Lets admins update environmental impact metrics and displays the current metric values.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for order queue management and analytics.",
  "frontend/src/pages/ArtifactDetailPage.tsx": "Displays detailed artifact info with audio playback and handles loading or missing artifact states.",
  "frontend/src/pages/HomePage.tsx": "Implements the landing page with a hero section and feature highlights.",
  "frontend/src/pages/LoyaltyPage.tsx": "Provides tabs for managing membership profile, loyalty points, and reward redemption.",
  "frontend/src/pages/MenuPage.tsx": "Shows the menu grouped by category and displays real‑time kitchen queue information.",
  "frontend/src/pages/MiniMuseumPage.tsx": "Displays artifacts with QR-scan info, map, and impact metrics, fetching data and showing loading states.",
  "frontend/src/pages/OrderStatusPage.tsx": "Polls and displays real-time order status with notifications, error handling, and status badges.",
  "frontend/src/pages/SpaceBookingPage.tsx": "Provides a tabbed interface for booking the venue and viewing a virtual tour.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and remove sensitive params from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Tracks project state, features, and pending admin-related requirements for the D'ZETA app."
}