{
  "kind": "build_request",
  "title": "Build branded Homepage for D’ZETA using provided SSS-tier copy + vintage-modern earth-tone styling",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a new dedicated Homepage at route '/' that implements the provided homepage copywriting as five sections in this order: (1) Hero section with headline, sub-headline, and two CTA buttons, (2) “The Digital Edge” value proposition grid with three feature blurbs, (3) “The Social & Eco Impact” section with body text and a live counter area, (4) “Explore Our Space (370 m²)” section listing the four zones with short descriptions, (5) a professional footer block matching the provided footer copy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-1"
        ],
        "quotes": [
          "ini draf Copywriting Homepage SSS-Tier ... Section 1 ... Section 5 ...",
          "langsung di build yaaa"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to '/' renders a homepage (not the Mini Museum page).",
        "All five sections are present and appear in the order provided by the user.",
        "Hero section includes 2 CTA buttons labeled exactly as provided in the draft.",
        "Explore Our Space section lists: Quiet Room, Rooftop Sanctuary, Mini Garden, Heritage Museum, each with its provided description."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Wire the homepage CTAs to existing routes: the primary CTA should navigate to the Menu/ordering experience, and the secondary CTA should navigate to an exploration experience (Mini Museum and/or booking) using the existing TanStack Router routes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "CTA Buttons:[Pesan Sekarang & Pantau Antrean] [Jelajahi Sudut D'ZETA]"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the primary CTA takes the user to an existing route for ordering/menu (e.g., '/menu').",
        "Clicking the secondary CTA takes the user to an existing route for exploring the space/storytelling (e.g., '/museum' or '/booking').",
        "Routing uses TanStack Router navigation (no full page refresh)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Apply the requested “Vintage Modern” look to the homepage (and only homepage if global theme changes are risky), using earth-tone styling aligned to the provided palette guidance: Deep Forest Green, Terracotta, and White Smoke; and use a serif headline + sans-serif body pairing consistent with the current Tailwind font configuration.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "CEO Pro-Tip: Pastikan UI (tampilan) web lo punya sentuhan Vintage Modern. Pake warna-warna bumi (earth tone) ...",
          "Warna: Gunakan perpaduan Deep Forest Green ... Terracotta ... White Smoke ...",
          "Font: Pakai kombinasi Serif ... dan Sans Serif ..."
        ]
      },
      "acceptanceCriteria": [
        "Homepage headings visibly use the serif font family and body text uses the sans font family.",
        "Homepage primary accents reflect earth-tone styling (green/terracotta) and remain readable in light mode.",
        "No immutable frontend hook files are modified."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update routing and navigation behaviors to reflect that '/' is now the Homepage: change the index route component to the new Homepage, update BottomNav active-state logic so it no longer treats '/' as the Museum route, and update any “Back to Home” navigation that currently points to '/museum' to instead point to '/'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "oh dan ini bikin homepage nya dulu",
          "langsung di build yaaa"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/App.tsx, the '/' route renders the new Homepage component.",
        "BottomNav does not highlight “Museum” when the user is on '/'.",
        "OrderStatusPage “Back to Home” navigates to '/'.",
        "The Museum page remains accessible at '/museum' and behaves as before."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement the Homepage “Live Counter” area using existing available metrics queries/components where possible, with graceful fallbacks if metrics are unavailable (e.g., show placeholders or ‘—’ rather than breaking layout). Counters must include the three items from the draft: ‘520+ Kilogram Limbah Terolah’, ‘5 Kecamatan Mitra Lokal’, and ‘100% Listrik Terjamin (Backup System)’.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Live Counter (Simulasi Angka):520+ Kilogram Limbah Terolah5 Kecamatan Mitra Lokal100% Listrik Terjamin (Backup System)"
        ]
      },
      "acceptanceCriteria": [
        "Homepage shows a 3-item counter block with the exact labels from the draft.",
        "If backend metrics queries fail or return empty, the homepage still renders without runtime errors and shows a sensible fallback state for the counters.",
        "If metrics are available, the UI may display real values but must preserve the three draft counter categories/labels."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only shadcn components).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep backend as a single Motoko actor; no additional backend services."
  ],
  "nonGoals": [
    "Implementing the 5 additional “Gong” features (reviews, zonal ordering/table mapping, per-order impact popup, menu-item ‘Story’ modal, and any new booking logic) beyond what is needed to build and route the homepage.",
    "Adding new authentication providers beyond Internet Identity.",
    "Real-time/WebSocket features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text in the build request."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}