{
  "kind": "build_request",
  "title": "Re-run build: ensure D'ZETA app compiles, deploys, and admin flows work end-to-end",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the project build and deploy successfully by resolving any compile-time or runtime integration errors between the React frontend and the Motoko backend (Candid/actor method mismatches, missing exports, type mismatches, or route initialization issues).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ulang build yang tadi"
        ]
      },
      "acceptanceCriteria": [
        "Frontend compiles with TypeScript without errors.",
        "Backend compiles in Motoko without errors.",
        "Generated frontend backend bindings match the Motoko canister interface (no missing methods referenced by the frontend).",
        "App starts without a blank screen or console-fatal errors on initial load."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the backend exposes and the frontend can call all admin-related APIs required by the existing admin UI: isCallerAdmin, getAdminOrdersQueue, getAdminAnalytics, and any access-control initialization method invoked by the frontend actor initialization.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ulang build yang tadi"
        ]
      },
      "acceptanceCriteria": [
        "Calling isCallerAdmin from an authenticated identity returns a boolean and does not trap for valid callers.",
        "Admin Orders/Queue panel can fetch orders (getAdminOrdersQueue) and update order status successfully (updateOrderStatus) when logged in as an admin.",
        "Admin Analytics panel can fetch analytics successfully (getAdminAnalytics) when logged in as an admin.",
        "Any access-control initialization call made by the frontend actor initialization succeeds (or is safely a no-op) and does not prevent the app from loading."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Verify and harden the initial admin bootstrap flow so that at least one admin can be assigned after deployment using the existing secureBootAdmin mechanism, without requiring code edits, and ensure the flow is compatible with the frontend’s admin token handling.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ulang build yang tadi"
        ]
      },
      "acceptanceCriteria": [
        "secureBootAdmin can be called successfully exactly once to establish the first admin.",
        "After an admin exists, subsequent calls to secureBootAdmin are rejected (trap or return a clear failure), preserving one-time bootstrap behavior.",
        "Once bootstrapped, isCallerAdmin returns true for the bootstrapped admin principal and false for non-admin principals.",
        "Developer-facing comments in backend/main.mo clearly describe the expected bootstrap steps and parameters (in English)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui). Compose around them instead.",
    "Keep all Motoko logic within the single actor in backend/main.mo.",
    "Create backend/migration.mo only if a persistent state upgrade is required; otherwise do not add migrations."
  ],
  "nonGoals": [
    "Adding new customer-facing features like e-wallet payments, WhatsApp ordering, QR table flow, or inventory supply-chain deduction logic (not requested in this rebuild request).",
    "Redesigning the UI/visual theme beyond what is necessary to fix build/deploy or broken screens.",
    "Introducing external databases or third-party authentication beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}