{
  "kind": "build_request",
  "title": "Implement Admin Login (Internet Identity) and Admin Dashboard Access Control",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the /admin route is protected by an admin-only gate that (1) prompts unauthenticated users to log in with Internet Identity, (2) blocks authenticated non-admin users with an access denied message, and (3) renders the admin dashboard only for authenticated admin users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ya bangn sekaranggg"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /admin while logged out shows an admin access required screen with an Internet Identity login button.",
        "After logging in, /admin shows the dashboard only if the signed-in principal is an admin; otherwise it shows an access denied UI.",
        "No edits are made to immutable hook/component paths listed in SYSTEM_CONTEXT (compose them instead)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement/verify backend admin authorization APIs required by the frontend admin gate and admin dashboard, including an isCallerAdmin query and ensuring all admin dashboard data/actions are guarded by admin permissions.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ya bangn sekaranggg"
        ]
      },
      "acceptanceCriteria": [
        "Calling isCallerAdmin returns true only for principals with admin permission and false otherwise.",
        "Admin-only backend methods (e.g., order status updates, content creation, bookings management) trap or reject when called by non-admin principals.",
        "User-facing (non-admin) endpoints continue to work for non-admin signed-in users without requiring admin permission."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a secure bootstrap mechanism to assign at least one initial admin so the admin dashboard can be accessed after deployment (without manual code edits), and document the expected flow in developer-facing comments.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ya bangn sekaranggg"
        ]
      },
      "acceptanceCriteria": [
        "A newly deployed canister has a deterministic way to establish the first admin (e.g., one-time initialization/claim flow), preventing the admin dashboard from being permanently inaccessible.",
        "The bootstrap flow cannot be used by arbitrary principals to gain admin after an admin has already been established.",
        "Attempting to re-run the bootstrap/claim flow after initialization fails safely (no privilege escalation)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the admin dashboard loads and its existing panels can fetch data and perform mutations end-to-end (as currently implemented), including at minimum the Orders/Queue panel and Analytics panel.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ya bangn sekaranggg"
        ]
      },
      "acceptanceCriteria": [
        "As an admin, opening /admin loads the dashboard page without runtime errors.",
        "Orders/Queue panel can fetch the admin orders list and update an order status successfully (with UI reflecting the updated state after refresh/invalidation).",
        "Analytics panel can fetch and display aggregate counts (orders/users/bookings/members) without errors.",
        "As a non-admin, attempts to call admin fetch/mutation endpoints from the UI result in a handled error state (no blank screen)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a stable-state upgrade is required.",
    "Do not edit files under frontend/src/components/ui or other paths listed in SYSTEM_CONTEXT.frontend.immutablePaths; compose them instead.",
    "Use English for any user-facing text added or changed as part of this build."
  ],
  "nonGoals": [
    "Implementing reviews, zonal ordering/table mapping, or any new modules not required for admin login/dashboard access.",
    "Adding third-party authentication providers (only Internet Identity is allowed).",
    "Adding real-time communication features (WebSockets, push notifications, chat)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}