{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "D'ZETA rebuild: fix frontend build/runtime integration and admin API wiring",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Resolve React↔Motoko integration/type mismatches so the app compiles cleanly and loads without fatal errors.",
      "acceptanceCriteria": [
        "Frontend compiles with TypeScript without errors.",
        "Generated frontend backend bindings match the Motoko canister interface (no missing methods referenced by the frontend).",
        "App starts without a blank screen or console-fatal errors on initial load."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the generated/checked-in canister TypeScript interface to match what the frontend actually calls (notably add the access-control initialization method invoked during actor creation: `_initializeAccessControlWithSecret(adminToken: string): Promise<void>`). Also align Principal typing/imports with the rest of the frontend so Order.customer and other Principal values typecheck correctly. This closes Candid/actor method mismatch compile errors."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust admin-related React Query hooks (and any related types) to rely on the corrected backend typings, and ensure their enabled/retry behavior cannot cause console-fatal errors during initial app load when the actor is not available yet (e.g., keep queries disabled until actor exists; keep retry=false for admin-only queries)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the existing admin UI can call required admin APIs and that access-control initialization invoked by actor setup does not break admin screens.",
      "acceptanceCriteria": [
        "Calling isCallerAdmin from an authenticated identity returns a boolean and does not trap for valid callers.",
        "Admin Orders/Queue panel can fetch orders (getAdminOrdersQueue) and update order status successfully (updateOrderStatus) when logged in as an admin.",
        "Admin Analytics panel can fetch analytics successfully (getAdminAnalytics) when logged in as an admin.",
        "Any access-control initialization call made by the frontend actor initialization succeeds (or is safely a no-op) and does not prevent the app from loading."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AdminGate.tsx",
          "operation": "modify",
          "description": "Harden admin gating UX around the authorization bootstrap/role-based access control flow: keep graceful handling for errors from `isCallerAdmin`, and when authenticated-but-not-admin, show a clear, non-blocking guidance message about the admin bootstrap token flow (e.g., instruct that an admin token may be required via the existing URL hash parameter used by actor initialization). Use the selected \"authorization\" component’s role-based access-control expectations for admin gating and error handling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminOrdersQueuePanel.tsx",
          "operation": "modify",
          "description": "Ensure the Orders/Queue panel’s fetch and status update flows tolerate authorization traps and display actionable errors (no unhandled promise rejections). Confirm the panel calls `getAdminOrdersQueue` and `updateOrderStatus` with correct types from the updated backend bindings, and that refresh/refetch continues working end-to-end behind AdminGate."
        },
        {
          "path": "frontend/src/pages/admin/AdminAnalyticsPanel.tsx",
          "operation": "modify",
          "description": "Ensure the Analytics panel fetch flow handles authorization failures gracefully (no fatal console errors) and uses the corrected backend bindings for `getAdminAnalytics`, including bigint-to-string display stability."
        }
      ]
    }
  ]
}